load_testing_api/scenarios/3_login.yaml
config:
  payload:
    path: "../mock_data/vusers.csv"
    fields:
      - "name"
      - "email"
      - "password"
    skipHeader: true
  environments:
    development:
      target: http://localhost:9000/api
      phases:
        - duration: 420
          arrivalRate: 4
          name: Soak test.
  plugins:
    apdex: {}
scenarios:
  - flow:
      - log: "Login {{ name }}"
      - post:
          url: "/users/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"